<?php
// 由 kuiyr0810(Sunshine.) 翻译;
// All rights reserved from 2025;

setlocale(LC_ALL, 'de_DE', 'german');
setlocale(LC_NUMERIC, 'C');

//SERVER GENERALS
$LNG['dir']         	= 'ltr';
$LNG['week_day']        = array('星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六');
$LNG['months']          = array('一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月');
$LNG['js_tdformat']		= '[M] [D] [d] [H]:[i]:[s]';
$LNG['php_timeformat']	= 'H:i:s';
$LNG['php_dateformat']	= 'd. M Y';
$LNG['php_tdformat']	= 'd. M Y, H:i:s';
$LNG['short_day']		= 'd';
$LNG['short_hour']		= 'h';
$LNG['short_minute']	= 'm';
$LNG['short_second']	= 's';

$LNG['timezones']    = array(
    '-12'    => '[UTC - 12] 贝克岛时间',
    '-11'    => '[UTC - 11] 纽埃时间，萨摩亚标准时间',
    '-10'    => '[UTC - 10] 夏威夷-阿留申标准时间，库克群岛时间',
    '-9.5'   => '[UTC - 9:30] 马克萨斯群岛时间',
    '-9'     => '[UTC - 9] 阿拉斯加标准时间，甘比尔群岛时间',
    '-8'     => '[UTC - 8] 太平洋标准时间',
    '-7'     => '[UTC - 7] 山地标准时间',
    '-6'     => '[UTC - 6] 中部标准时间',
    '-5'     => '[UTC - 5] 东部标准时间',
    '-4.5'   => '[UTC - 4:30] 委内瑞拉标准时间',
    '-4'     => '[UTC - 4] 大西洋标准时间',
    '-3.5'   => '[UTC - 3:30] 纽芬兰标准时间',
    '-3'     => '[UTC - 3] 亚马逊标准时间，格陵兰中部时间',
    '-2'     => '[UTC - 2] 费尔南多·迪诺罗尼亚时间，南乔治亚和南桑威奇群岛时间',
    '-1'     => '[UTC - 1] 亚速尔群岛标准时间，佛得角时间，格陵兰东部时间',
    '0'      => '[UTC] 西欧时间，格林威治标准时间',
    '1'      => '[UTC + 1] 中欧时间，西非时间',
    '2'      => '[UTC + 2] 东欧时间，中非时间',
    '3'      => '[UTC + 3] 莫斯科标准时间，东非时间',
    '3.5'    => '[UTC + 3:30] 伊朗标准时间',
    '4'      => '[UTC + 4] 海湾标准时间，萨马拉标准时间',
    '4.5'    => '[UTC + 4:30] 阿富汗时间',
    '5'      => '[UTC + 5] 巴基斯坦标准时间，叶卡捷琳堡标准时间',
    '5.5'    => '[UTC + 5:30] 印度标准时间，斯里兰卡时间',
    '5.75'   => '[UTC + 5:45] 尼泊尔时间',
    '6'      => '[UTC + 6] 孟加拉国时间，不丹时间，新西伯利亚标准时间',
    '6.5'    => '[UTC + 6:30] 科科斯群岛时间，缅甸时间',
    '7'      => '[UTC + 7] 印度支那时间，克拉斯诺亚尔斯克标准时间',
    '8'      => '[UTC + 8] 中国标准时间，澳大利亚西部标准时间，伊尔库茨克标准时间',
    '8.75'   => '[UTC + 8:45] 澳大利亚东南部西部标准时间',
    '9'      => '[UTC + 9] 日本标准时间，韩国标准时间，赤塔标准时间',
    '9.5'    => '[UTC + 9:30] 澳大利亚中部标准时间',
    '10'     => '[UTC + 10] 澳大利亚东部标准时间，符拉迪沃斯托克标准时间',
    '10.5'   => '[UTC + 10:30] 豪勋爵岛标准时间',
    '11'     => '[UTC + 11] 所罗门群岛时间，马加丹标准时间',
    '11.5'   => '[UTC + 11:30] 诺福克岛时间',
    '12'     => '[UTC + 12] 新西兰时间，斐济时间，堪察加标准时间',
    '12.75'  => '[UTC + 12:45] 查塔姆群岛时间',
    '13'     => '[UTC + 13] 汤加时间，凤凰群岛时间',
    '14'     => '[UTC + 14] 莱恩群岛时间',
);